//1. задание №3 с функцией и двумя параметрами
function showWeather(city, temperature) {
  console.log(`Сейчас в ${city} температура — ${temperature} градусов по Цельсию`);
}

showWeather('Каир', 26);  // Выведет: Сейчас в Каир температура — 26 градусов по Цельсию
showWeather('Кейптаун', 20);   // Выведет: Сейчас в Кейптаун температура — 20 градусов по Цельсию
showWeather('Якутск', -3); // Выведет: Сейчас в Якутск температура — -3 градусов по Цельсию

//2. Задание № 4 про скорость света
const speedOfLight = 299792458; 
function checkSpeed(speed) {
  if (speed > speedOfLight) {
    console.log('Сверхсветовая скорость');// Сработает, если переданная скорость больше скорости света

  } else if (speed < speedOfLight) {

    console.log('Субсветовая скорость');// Сработает, если переданная скорость меньше скорости света
    
  } else {
    
    console.log('Скорость света'); // Сработает во всех остальных случаях (то есть когда они равны)
    
  }
}

checkSpeed(50000);        // Выведет: Субсветовая скорость
checkSpeed(350000000);    // Выведет: Сверхсветовая скорость
checkSpeed(299792458);    // Выведет: Скорость света


//3. Задание №5. Создаем переменную №1 и №2, содержащую его цену 
const product = 'Лодка';
const price = 800; // Цена товара в \$

//Далее создаем функцию, которая принимает 1 параметр - текущий бюджет
function buyProduct(budget) {
  if (budget >= price) {
    
    // Если денег больше или ровно столько, сколько стоит товар
    console.log(`${product} приобретен. Спасибо за покупку!`);
    
  } else {
    
    // Если денег меньше, считаем разницу
    const insufficientunds = price - budget;
    console.log(`Вам не хватает ${insufficientunds} $, пополните баланс`);
    
  }
}

//Проверяем работу функции:
buyProduct(1000); // Бюджет 1000\$. Выведет: Лодка приобретена. Спасибо за покупку!
buyProduct(500);  // Бюджет 500\(. Выведет: Вам не хватает 300 \), пополните баланс
buyProduct(800);  // Бюджет 800\$. Выведет: Лодка приобретена. Спасибо за покупку!



//Задание №6. Создать 1 функцию и назвать ее по своему усмотрению
function globalWelcome() {
  console.log('Привет! Я — функция.');
}
